JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if GIGADEVICE_DEVICE_SERIE
            // GigaDevice
            case GIGADEVICE_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- GigaDevice Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        case 0x40:
                            // GD25D DualSPI
                            mfb_printf(" -- GD25Q/GD25B/GD25S QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x42:
                            mfb_printf(" -- GD25VQ/GD25VE QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x47:
                            mfb_printf(" -- GD55B QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            // GD25LD DualSPI
                            mfb_printf(" -- GD25LE/GD25LQ QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x63:
                            mfb_printf(" -- GD25LF/GD55LF QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x65:
                            // GD25WD DualSPI
                            mfb_printf(" -- GD25W/GD55W QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x66:
                            mfb_printf(" -- GD25LT/GD55LT QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x67:
                            mfb_printf(" -- GD25LB/GD55LB QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x68:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- GD25LX/GD55LX OctalSPI 1.8V Series.\r\n");
                            break;
                        // Missing GD25F, GD25LR, GD25T, GD25R
                        // Missing GD25X,
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if GIGADEVICE_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashBusyStatusPol    = GIGADEVICE_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = GIGADEVICE_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = GIGADEVICE_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_GIGADEVICE_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = GIGADEVICE_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // GIGADEVICE_DEVICE_SERIE

#if ADESTO_DEVICE_SERIE
            // Adesto
            case ADESTO_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- Adesto Serial Flash.\r\n");
                    if (jedecID.memoryTypeID != 0x42)
                    {
                        jedecID.capacityID = jedecID.memoryTypeID & 0x1F;
                        jedecID.memoryTypeID = (jedecID.memoryTypeID & 0xE0) >> 5;
                        mfb_printf("MFB: Flash Family Code: 0x%x", jedecID.memoryTypeID);
                    }
                    else
                    {
                        mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    }
                    switch (jedecID.memoryTypeID)
                    {
                        case 0x00:
                            mfb_printf(" -- AT25EU QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x01:
                            mfb_printf(" -- AT25DQ QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x02:
                            mfb_printf(" -- AT25FF/AT25XE/AT25XV QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x04:
                            mfb_printf(" -- AT25SF/AT25QF QuadSPI 3.3V Series.\r\n");
                            break;
                        // Only this type is same as other vendors
                        case 0x42:
                            mfb_printf(" -- AT25SL/AT25QL QuadSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    if (jedecID.memoryTypeID != 0x42)
                    {
                        mfb_show_mem_size(jedecID.capacityID, true);
                        cfg_flashMemSizeInByte = mfb_decode_adesto_capacity_id(jedecID.capacityID);
                    }
                    else
                    {
                        mfb_show_mem_size(jedecID.capacityID, false);
                        cfg_flashMemSizeInByte = mfb_decode_common_capacity_id(jedecID.capacityID);
                    }
#if ADESTO_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_133MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashBusyStatusPol    = ADESTO_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ADESTO_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = ADESTO_FLASH_QUAD_ENABLE;
                        cfg_customLUTVendor     = s_customLUT_ADESTO_Quad;
                    }
#endif
                    break;
                }
#endif // ADESTO_DEVICE_SERIE

            default:
                mfb_printf("\r\nMFB: Unsupported Manufacturer ID\r\n");
                sta_isValidVendorId = false;
                break;
        }
        if (sta_isValidVendorId)
        {
            /* Configure FlexSPI pinmux as user prescriptive */
            flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, cfg_pad);
            /* Update root clock */
            //s_deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
            s_deviceconfig.flashSize = cfg_flashMemSizeInByte / 0x400;
            /* Re-init FlexSPI using custom LUT */
            flexspi_nor_flash_init(EXAMPLE_FLEXSPI, cfg_customLUTVendor, cfg_readSampleClock);
            mfb_printf("\r\nMFB: FLEXSPI module is initialized to multi-I/O fast read mode.\r\n");
            /* Write dummy cycle value into flash if needed */
            if (cfg_dummyValue != DUMMY_VALUE_INVALID)
            {
                flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, (uint8_t)(cfg_dummyValue & 0xFF));
                mfb_printf("MFB: Flash dummy cycle is set to %d.\r\n", cfg_dummyValue);
            }
            if (!sta_isOctalFlash)
            {
                /* Enable quad mode. */
                status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                if (status != kStatus_Success)
                {
                    mfb_printf("MFB: Flash failed to Enter Quad I/O SDR mode.\r\n");
                }
                else
                {
                    mfb_printf("MFB: Flash entered Quad I/O SDR mode.\r\n");
                }
            }
            else
            {
                /* Enter octal DDR mode. */
#if !MFB_FLASH_FORCE_LOOPBACK_DQS
                status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                sta_isOctalDdrMode = true;
#endif
                if (status != kStatus_Success)
                {
                    mfb_printf("MFB: Flash failed to Enter Octal I/O DDR mode.\r\n");
                }
                else
                {
                    if (sta_isOctalDdrMode)
                    {
                        mfb_printf("MFB: Flash entered Octal I/O DDR mode.\r\n");
                    }
                    else
                    {
                        mfb_printf("MFB: Flash ran in Octal I/O SPI mode.\r\n");
                    }
                }
            }
            if (status == kStatus_Success)
            {
                mfb_show_flash_registers();
                bool isFirstTry = true;
                while (1)
                {
                    if (!mfb_flash_pattern_verify_test(!isFirstTry))
                    {
                         if (isFirstTry)
                         {
                             if (!mfb_flash_write_pattern_region(sta_isOctalDdrMode))
                             {
                                 return;
                             }
                         }
                         else
                         {
                             return;
                         }
                    }
                    if (isFirstTry)
                    {
                        /* Configure FlexSPI clock as user prescriptive */ 
                        flexspi_clock_init(EXAMPLE_FLEXSPI, cfg_rootClkFreq);
                        /* Show FlexSPI clock source */
                        flexspi_show_clock_source(EXAMPLE_FLEXSPI);
                        isFirstTry = false;
                    }
                    else
                    {
                        break;
                    }
                }
                mfb_flash_memcpy_perf_test(false);
                mfb_jump_to_application(EXAMPLE_FLEXSPI_AMBA_BASE + MFB_APP_IMAGE_OFFSET);
            }
        }
    }
}
